# MassDataMassExteriorWallArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassDataMassExteriorWallArea Property
ParameterTypeId Class See Also
---
"Mass Exterior Wall Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassDataMassExteriorWallArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassDataMassExteriorWallArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassDataMassExteriorWallArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace